# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args] args: output_channels, kernel_size, stride, padding
  [
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2    # 320x320x32
   
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4      # 160x160x64
   [-1, 3, C3, [128]], # 2                    # 160x160x64
   [-1, 1, FEM, [128]], # 3                   # 160x160x64
   
   [-2, 1, Conv, [256, 3, 2]], # 4            # 80x80x128
   [-1, 6, C3, [256]], # 5                    # 80x80x128
   [-1, 1, FEM, [256]], # 6                   # 80x80x128
   
   [-2, 1, Conv, [512, 3, 2]],  # 7           # 40x40x256
   [-1, 9, C3, [512]], # 8
   [-1, 1, SPPF, [512, 5]],  # 9             # Neck
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]],                  # 40x40x128
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 80x80x128
   [[-1, 6], 1, Concat, [1]],  # cat            # 80x80x256
   [-1, 3, C3, [256, False]],  # 13             # 80x80x128

   [-1, 1, Conv, [128, 1, 1]], # 14             # 80x80x64
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 160x160x64
   [[-1, 3], 1, Concat, [1]],  # 16 cat         # 160x160x128
   [-1, 3, C3, [128, False]],  # 17             # 160x160x64 P/4

   [-1, 1, Conv, [128, 3, 2]],                # 80x80x64
   [[-1, 6, 14], 1, Concat, [1]],  # cat      # 80x80x256
   [-1, 3, C3, [256, False]],  # 20           # 80x80x128 P/8

   [-1, 1, Conv, [256, 3, 2]], # 21           # 40x40x128
   [[-1, 10], 1, Concat, [1]],  # 22 cat      # 40x40x256
   [-1, 3, C3, [512, False]],  # 23           # 40x40x256 P/16

   [17, 1, SCAM, [ ]], # 24
   [20, 1, SCAM, [ ]], # 25
   [23, 1, SCAM, [ ]], # 26

   [[24, 25, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
