# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer
#  - [10,15, 13,19, 15,23] 
#  - [20,21, 18,28, 25,25]
#  - [23,31, 21,39, 30,37]
#  - [37,32, 33,50, 57,30]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
  #  [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
  #  [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
  #  [-1, 3, C3, [128]],
  #  [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
  #  [-1, 6, C3, [256]],
  #  [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
  #  [-1, 9, C3, [512]],
  #  [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
  #  [-1, 3, C3, [1024]],
  #  [-1, 1, SPPF, [1024, 5]],  # 9
   [-1, 1, MobileNetV3P2, [16, 1]],     # 0-P2/4  160x160
   [-1, 1, MobileNetV3P2, [24, 2]],     # 1-P3/8  80x80
   [-1, 1, MobileNetV3P2, [48, 3]],     # 2-P4/16 40x40
   [-1, 1, MobileNetV3P2, [576, 4]]     # 3-P5/32 20x20
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 1], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 0], 1, Concat, [1]],  # cat backbone P2
   [-1, 1, C3, [128, False]],  # 21 (P2/4-xsmall)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P3
   [-1, 3, C3, [256, False]],  # 24 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 8], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 27 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 4], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 30 (P5/32-large)

   [[15, 18, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
