# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args] args: output_channels, kernel_size, stride, padding
  [
   [-1, 1, MobileNetV3, [24, 1]],     # 0-P3/8  80x80
   [-1, 1, MobileNetV3, [48, 2]],     # 1-P4/16 40x40
   [-1, 1, MobileNetV3, [576, 3]]     # 2-P5/32 20x20
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],    # 3 256x20x20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 4 256x40x40
   [[-1, 1], 1, Concat, [1]],  # 5 cat backbone P4
   [-1, 3, C3, [512, False]],  # 6  256x40x40

   [-1, 1, Conv, [256, 1, 1]],  # 7 128x40x40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 8 128x80x80
   [[-1, 0], 1, Concat, [1]],  # 9 cat backbone P3  
   [-1, 3, C3, [256, False]],  # 10 (P3/8-small)  # 128x80x80

   [-1, 1, Conv, [256, 3, 2]],  # 11 128x40x40
   [[-1, 7], 1, Concat, [1]],  # 12 cat head P4    
   [-1, 3, C3, [512, False]],  # 13 (P4/16-medium)  256x40x40

   [-1, 1, Conv, [512, 3, 2]],  # 14 256x20x20
   [[-1, 3], 1, Concat, [1]],  # 15 cat head P5  
   [-1, 3, C3, [1024, False]],  # 16 (P5/32-large) 512x20x20

   [10, 1, SCAM, [ ]], # 17
   [13, 1, SCAM, [ ]], # 18
   [16, 1, SCAM, [ ]], # 19

   [[17, 18, 19], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
# [1x128x80x80, 1x256x40x40, 1x512x20x20]