# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
  #  [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
  #  [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
  #  [-1, 3, C3, [128]],
  #  [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
  #  [-1, 6, C3, [256]],
  #  [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
  #  [-1, 9, C3, [512]],
  #  [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
  #  [-1, 3, C3, [1024]],
  #  [-1, 1, SPPF, [1024, 5]],  # 9

   [-1, 1, MobileNetV3P2, [16, 1]],     # 0-P2/4  160x160
   [-1, 1, MobileNetV3P2, [24, 2]],     # 1-P3/8  80x80
   [-1, 1, MobileNetV3P2, [48, 3]],     # 2-P4/16 40x40
   [-1, 1, MobileNetV3P2, [576, 4]]     # 3-P5/32 20x20
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #4 256x20x20
   [1, 1, Conv, [512, 1, 1]],  #5 24x80x80
   [[-1, 2, -2], 1, Zoom_cat, []],  # 6 cat backbone P4 Zoom_cat 保留中间尺寸 
   [-1, 3, C3, [512, False]],  # 7  256x40x40 

   [-1, 1, Conv, [256, 1, 1]], #8 128x40x40
   [0, 1, Conv, [256, 1, 1]],  #9 16x160x160
   [[-1, 1, -2], 1, Zoom_cat, []],  #10  cat backbone P3
   [-1, 3, C3, [256, False]],  # 11 (P3/8-small)  128x80x80

   [-1, 1, Conv, [256, 3, 2]], #12 128x40x40
   [[-1, 8], 1, Concat, [1]],  #13 cat head P4
   [-1, 3, C3, [512, False]],  # 14 (P4/16-medium) 256x40x40

   [-1, 1, Conv, [512, 3, 2]], #15 256x20x20
   [[-1, 4], 1, Concat, [1]],  #16 cat head P5
   [-1, 3, C3, [1024, False]],  # 17 (P5/32-large) 512x20x20

   [[1, 2, 3], 1, ScalSeq, [48]], #18 args[inchane] 24x80x80
   [-1, 3, C3, [256, False]], #19 128x80x80
   [[11, -1], 1, attention_model, []], #20  128x80x80

   [[20, 14, 17], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]